In [7]:
# conda install -c anaconda pandas
import pandas as pd

# Статистика датасета

In [8]:
%%time
data = pd.read_csv('power.csv')
data.head()

   country  year  quantity  category
0  Austria  1996       5.0         1
1  Austria  1995      17.0         1
2  Belgium  2014       0.0         1
3  Belgium  2013       0.0         1
4  Belgium  2012      35.0         1

In [9]:
data.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 1189482 entries, 0 to 1189481
Data columns (total 4 columns):
country     1189482 non-null object
year        1189482 non-null int64
quantity    1189482 non-null float64
category    1189482 non-null int64
dtypes: float64(1), int64(2), object(1)
memory usage: 36.3+ MB

In [10]:
data.shape

(1189482, 4)

In [11]:
data.describe()

               year      quantity      category
count  1.189482e+06  1.189482e+06  1.189482e+06
mean   2.002852e+03  1.842648e+05  3.624763e+01
std    7.167345e+00  1.585663e+07  1.809968e+01
min    1.990000e+03 -8.643480e+05  1.000000e+00
25%    1.997000e+03  1.400000e+01  2.400000e+01
50%    2.003000e+03  1.890000e+02  3.500000e+01
75%    2.009000e+03  2.265000e+03  5.100000e+01
max    2.014000e+03  6.680329e+09  7.100000e+01

In [13]:
data['year'].unique()

array([1996, 1995, 2014, 2013, 2012, 2011, 2010, 2009, 1998, 2008, 2007,
       2006, 2005, 2004, 2003, 2002, 2001, 2000, 1999, 1997, 1994, 1993,
       1992, 1991, 1990], dtype=int64)

In [15]:
data['year'].value_counts()

2014    56264
2013    56109
2012    55838
2011    55214
2010    54544
2008    53852
2009    53769
2007    52248
2006    49397
2005    49203
2004    47723
2003    46922
2002    46520
2001    45609
2000    45220
1999    44682
1997    44579
1998    44487
1996    43550
1995    43515
1993    43112
1994    42787
1992    41753
1990    36305
1991    36280
Name: year, dtype: int64

In [12]:
data['category'].unique()

array([ 1,  2,  3,  4,  5,  6,  7,  8,  9, 10, 11, 13, 12, 14, 15, 16, 17,
       18, 19, 20, 21, 22, 23, 24, 25, 26, 27, 28, 29, 30, 31, 32, 33, 34,
       35, 36, 37, 38, 39, 40, 41, 42, 43, 44, 45, 46, 47, 48, 49, 50, 51,
       52, 53, 54, 55, 56, 57, 58, 59, 60, 61, 62, 63, 64, 65, 66, 67, 68,
       69, 70, 71], dtype=int64)

In [9]:
len(data['country'].unique())

243

In [8]:
data['country'].value_counts()

Germany                                     20422
United States                               19847
Poland                                      19802
Austria                                     17440
Romania                                     17357
France                                      17236
Japan                                       17037
Czechia                                     16588
Italy                                       16312
Netherlands                                 15955
Spain                                       15815
Hungary                                     15778
Australia                                   15652
United Kingdom                              15536
Canada                                      15453
Russian Federation                          15020
Finland                                     14982
Belgium                                     14914
Korea, Republic of                          14849
Slovakia                                    14676
Sweden                                      14154
Denmark                                     13127
Norway                                      12664
Turkey                                      12526
Portugal                                    12215
Bulgaria                                    12104
Switzerland                                 11890
Greece                                      11753
Croatia                                     11607
China                                       11563
                                            ...
Puerto Rico                                   900
Jersey                                        899
St. Pierre-Miquelon                           874
Cook Islands                                  791
Ethiopia, incl. Eritrea                       618
Wallis and Futuna Is.                         599
United States Virgin Is.                      585
Timor-Leste                                   575
Isle of Man                                   572
Sudan                                         519
American Samoa                                503
Marshall Islands                              468
Curaçao                                       452
Guam                                          435
Liechtenstein                                 415
Yugoslavia, SFR (former)                      395
Northern Mariana Islands                      357
USSR (former)                                 350
Guernsey                                      336
Czechoslovakia (former)                       325
South Sudan                                   305
Germany, Fed. R. (former)                     293
Bonaire, St Eustatius, Saba                   224
Sint Maarten (Dutch part)                     219
German Dem. R. (former)                       106
Antarctic Fisheries                            90
Pacific Islands (former)                       68
Yemen, Dem. (former)                           61
Yemen Arab Rep. (former)                       45
Commonwealth of Independent States (CIS)       16
Name: country, Length: 243, dtype: int64

# Фильтрация данных

In [4]:
#data = pd.read_csv('transactions.csv', names = ['country', 'year', 'quantity', 'category'], sep = '\t')
#data.head()

                          country  year  quantity  category
0  country,year,quantity,category   NaN       NaN       NaN
1              Austria,1996,5.0,1   NaN       NaN       NaN
2             Austria,1995,17.0,1   NaN       NaN       NaN
3              Belgium,2014,0.0,1   NaN       NaN       NaN
4              Belgium,2013,0.0,1   NaN       NaN       NaN

In [3]:
data1 = pd.read_csv('transactions.csv', sep = ';')
data1.head()

     Year  Month    ID Product  Amount   Price    Total    Cost
0  2012.0    1.0  t001      A1     7.0  2904.0  20328.0  1200.0
1  2012.0    1.0  t002      A2     2.0  1896.0   3792.0  1100.0
2  2012.0    2.0  t003      A1     5.0  2904.0  14520.0  1200.0
3  2012.0    2.0  t004      A4     1.0  8618.0   8618.0  4200.0
4  2012.0    2.0  t005      A5     3.0  5175.0  15525.0   500.0

In [21]:
data1['Product'].value_counts()

_5    11
_2     8
_8     8
_3     7
_4     7
A4     5
A5     5
A1     5
_6     2
A2     2
Name: Product, dtype: int64

In [22]:
data1['Price'].mean()

4427.183333333333

In [23]:
sum(data1['Price']) / len(data1)

nan

In [24]:
data1.describe()

         Year      Month     Amount        Price         Total         Cost
count    60.0  60.000000  60.000000    60.000000     60.000000    60.000000
mean   2012.0   7.250000   3.750000  4427.183333  14704.450000  1063.333333
std       0.0   3.337638   2.229426  2506.427558  10009.347373   902.297757
min    2012.0   1.000000   1.000000  1265.000000   1896.000000   200.000000
25%    2012.0   5.000000   2.000000  1896.000000   7584.000000   650.000000
50%    2012.0   7.000000   3.000000  3760.000000  11280.000000   800.000000
75%    2012.0  10.250000   5.000000  5175.000000  18009.000000  1200.000000
max    2012.0  12.000000  10.000000  8618.000000  43090.000000  4200.000000

In [25]:
data1.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 63 entries, 0 to 62
Data columns (total 8 columns):
Year       60 non-null float64
Month      60 non-null float64
ID         60 non-null object
Product    60 non-null object
Amount     60 non-null float64
Price      60 non-null float64
Total      60 non-null float64
Cost       60 non-null float64
dtypes: float64(6), object(2)
memory usage: 4.0+ KB

In [26]:
len(data1)

63

In [28]:
average_level = data['quantity'].mean()
average_level

184264.77005012965

In [29]:
country_stats = data.filter(items = ['country', 'quantity'])
country_stats.head()

   country  quantity
0  Austria       5.0
1  Austria      17.0
2  Belgium       0.0
3  Belgium       0.0
4  Belgium      35.0

In [30]:
country_stats.query('quantity > 184264.77005012965').head()

            country  quantity
3228  United States  367987.0
3229  United States  384439.0
3230  United States  370625.0
3231  United States  310909.0
3232  United States  335418.0

In [33]:
#quantity > {}'.format(average_level)

In [35]:
above_average = country_stats.query('quantity > {}'.format(average_level))
above_average.head()

            country  quantity
3228  United States  367987.0
3229  United States  384439.0
3230  United States  370625.0
3231  United States  310909.0
3232  United States  335418.0

In [40]:
data['country'].value_counts()

Germany                                     20422
United States                               19847
Poland                                      19802
Austria                                     17440
Romania                                     17357
France                                      17236
Japan                                       17037
Czechia                                     16588
Italy                                       16312
Netherlands                                 15955
Spain                                       15815
Hungary                                     15778
Australia                                   15652
United Kingdom                              15536
Canada                                      15453
Russian Federation                          15020
Finland                                     14982
Belgium                                     14914
Korea, Republic of                          14849
Slovakia                                    14676
Sweden                                      14154
Denmark                                     13127
Norway                                      12664
Turkey                                      12526
Portugal                                    12215
Bulgaria                                    12104
Switzerland                                 11890
Greece                                      11753
Croatia                                     11607
China                                       11563
                                            ...
Puerto Rico                                   900
Jersey                                        899
St. Pierre-Miquelon                           874
Cook Islands                                  791
Ethiopia, incl. Eritrea                       618
Wallis and Futuna Is.                         599
United States Virgin Is.                      585
Timor-Leste                                   575
Isle of Man                                   572
Sudan                                         519
American Samoa                                503
Marshall Islands                              468
Curaçao                                       452
Guam                                          435
Liechtenstein                                 415
Yugoslavia, SFR (former)                      395
Northern Mariana Islands                      357
USSR (former)                                 350
Guernsey                                      336
Czechoslovakia (former)                       325
South Sudan                                   305
Germany, Fed. R. (former)                     293
Bonaire, St Eustatius, Saba                   224
Sint Maarten (Dutch part)                     219
German Dem. R. (former)                       106
Antarctic Fisheries                            90
Pacific Islands (former)                       68
Yemen, Dem. (former)                           61
Yemen Arab Rep. (former)                       45
Commonwealth of Independent States (CIS)       16
Name: country, Length: 243, dtype: int64

Более удобные фильтры

In [41]:
data[ data.quantity > average_level ].head # В этом случае поле quantity не может содержать пробелы

            country  year  quantity  category
3228  United States  2014  367987.0         2
3229  United States  2013  384439.0         2
3230  United States  2012  370625.0         2
3231  United States  2011  310909.0         2
3232  United States  2010  335418.0         2

In [95]:
data[ data['quantity'] > average_level ].head() # А тут поле quantity может содержать пробелы

NameError: name 'average_level' is not defined

In [43]:
len(data.country.unique())

243

In [44]:
data[ data['country'].str.contains('rus', case=False) ]['country'].unique() 
# Параметр case=False означает, что поиск будет производиться без учета регистра букв

array(['Brunei Darussalam', 'Russian Federation', 'Belarus', 'Cyprus'],
      dtype=object)

In [46]:
len(data[ data['country'].str.contains('state', case=False) ]['country'].unique() )

6

In [55]:
filtered_countries = data[ (data['country']=='Russian Federation') | (data['country']=='Belarus') ]
filtered_countries.head()

                 country  year  quantity  category
6940  Russian Federation  2014   12714.0         3
6941  Russian Federation  2013   11285.0         3
6942  Russian Federation  2012   11302.0         3
6943  Russian Federation  2011    7611.0         3
6944  Russian Federation  2010    9263.0         3

In [ ]:
# Применяем метод groupby для группировки строк по годам, считаем количество строк,
# относящихся к определенному году с помощью count() и сортируем по любому столбцу,
# чтобы получить наиболее удобный для нас вид
filtered_countries.groupby('year').count().sort_values('category', ascending=False)

In [17]:
data[ (data['country']=='Russian Federation') | (data['country']=='Belarus') ]['year'].value_counts()

2010    1215
2008    1203
2009    1192
2011    1191
2012    1183
2014    1171
2013    1163
2007    1150
2006    1146
2005    1040
2003     997
2004     993
2000     984
2002     982
2001     972
1999     942
1998     934
1997     914
1995     898
1996     896
1993     860
1994     857
1992     814
Name: year, dtype: int64

In [48]:
# метод loc, который дополняет предыдущий способ фильтрации возможностью добавлять условия на столбцы
data.loc[100:105, ['country', 'quantity']]

         country  quantity
100  Netherlands     276.0
101  Netherlands     302.0
102  Netherlands     271.0
103  Netherlands     244.0
104  Netherlands     251.0
105  Netherlands     364.0

In [49]:
data.loc[data['year'] == 2014, 'quantity']

2               0.00
26            119.00
45              2.00
57              4.00
86            390.00
106             0.00
114             4.00
120             0.00
127            54.00
128          2484.00
166             0.00
172             8.00
177            36.00
187          5240.00
194           302.00
203            58.00
221            12.00
262            89.00
286           221.00
311             0.00
323          1538.00
331           199.00
354           103.00
358            46.00
373            39.00
381           454.00
406           665.00
426           318.00
433           317.00
441            79.00
             ...
1189063       116.30
1189068       256.00
1189083       152.10
1189097      7676.00
1189117     12111.00
1189142       219.10
1189144         1.00
1189151        15.70
1189162      6201.00
1189176        96.00
1189194         7.09
1189196         6.00
1189208         4.00
1189215      1070.00
1189229     52013.00
1189254       273.45
1189270         1.01
1189277         8.00
1189283         0.87
1189298     11234.00
1189323       101.00
1189342       305.00
1189359       507.00
1189377      8520.00
1189394      1130.00
1189411     32015.00
1189436    183892.00
1189461       732.60
1189468         3.00
1189475       300.00
Name: quantity, Length: 56264, dtype: float64

In [16]:
%%time
data1 = pd.read_csv('transactions_data.csv')

Wall time: 0 ns

In [15]:
data1.head()

   Year  Month    ID Product  Amount  Price  Total  Cost
0  2017      1  t001      A1       7   2904  20328  1200
1  2017      1  t002      A2       2   1896   3792  1100
2  2017      2  t003      A1       5   2904  14520  1200
3  2017      2  t004      A4       1   8618   8618  4200
4  2017      2  t005      A5       3   5175  15525   500

In [14]:
len(data1)

60

# СОРТИРОВКА

In [19]:
data.sort_values(by='quantity').head() # По умолчанию сортировка столбцов происходит по возрастанию.

              country  year  quantity  category
832375  United States  2000 -864348.0        42
832373  United States  2002 -562414.0        42
832362  United States  2013 -551490.0        42
832380  United States  1995 -493380.0        42
832322        Ukraine  2010 -477263.0        42

In [20]:
data.sort_values(by='quantity', ascending=False)

                   country  year      quantity  category
492581       United States  2014  6.680329e+09        31
492267       United States  2014  6.680329e+09        31
492047               China  2014  5.462672e+09        31
492345               China  2014  5.462672e+09        31
122392       USSR (former)  1990  3.257000e+09        12
121415       USSR (former)  1990  3.100000e+09        12
492220  Russian Federation  2014  2.727915e+09        31
492530  Russian Federation  2014  2.727915e+09        31
122345  Russian Federation  1997  2.482908e+09        12
121392  Russian Federation  1997  2.358085e+09        12
492589       USSR (former)  1990  2.230000e+09        31
836155       USSR (former)  1990  2.127815e+09        42
491533       USSR (former)  1990  2.100000e+09        31
835931  Russian Federation  1993  1.879251e+09        42
835924  Russian Federation  2005  1.865984e+09        42
835923  Russian Federation  2007  1.865750e+09        42
835929  Russian Federation  1998  1.863253e+09        42
835928  Russian Federation  1999  1.863253e+09        42
835930  Russian Federation  1997  1.861302e+09        42
835922  Russian Federation  2008  1.752043e+09        42
835927  Russian Federation  2000  1.746190e+09        42
835926  Russian Federation  2001  1.745991e+09        42
835925  Russian Federation  2002  1.745991e+09        42
492532  Russian Federation  1997  1.658232e+09        31
492014           Australia  2014  1.598761e+09        31
492306           Australia  2014  1.598761e+09        31
491505  Russian Federation  1997  1.582479e+09        31
122385       United States  2014  1.398360e+09        12
122084       United States  2014  1.398360e+09        12
122343  Russian Federation  2014  1.379623e+09        12
...                    ...   ...           ...       ...
831552              Canada  2013 -1.276650e+05        42
831563              Canada  2002 -1.305280e+05        42
832182  Russian Federation  2014 -1.309760e+05        42
832335             Ukraine  1993 -1.371900e+05        42
832334             Ukraine  1994 -1.428080e+05        42
831743             Germany  2010 -1.463830e+05        42
831562              Canada  2003 -1.832430e+05        42
831566              Canada  1999 -1.859260e+05        42
831556              Canada  2009 -2.024650e+05        42
832368       United States  2007 -2.131470e+05        42
831561              Canada  2004 -2.201230e+05        42
831564              Canada  2001 -2.304240e+05        42
832376       United States  1999 -2.406250e+05        42
832187  Russian Federation  2009 -2.451590e+05        42
832383       United States  1992 -2.464160e+05        42
832384       United States  1991 -2.716160e+05        42
831560              Canada  2005 -2.812490e+05        42
831557              Canada  2008 -2.815940e+05        42
831808           Indonesia  2000 -2.850000e+05        42
832382       United States  1993 -3.062250e+05        42
831555              Canada  2010 -3.065580e+05        42
831809           Indonesia  1999 -3.150000e+05        42
831558              Canada  2007 -3.262750e+05        42
831565              Canada  2000 -3.372660e+05        42
832199  Russian Federation  1997 -4.335110e+05        42
832322             Ukraine  2010 -4.772630e+05        42
832380       United States  1995 -4.933800e+05        42
832362       United States  2013 -5.514900e+05        42
832373       United States  2002 -5.624140e+05        42
832375       United States  2000 -8.643480e+05        42

[1189482 rows x 4 columns]

In [25]:
data.sort_values(by=['country', 'year'], ascending=[True, True]).head()

           country  year  quantity  category
9996   Afghanistan  1990       3.0         4
12134  Afghanistan  1990       3.0         4
14904  Afghanistan  1990       3.0         4
17054  Afghanistan  1990       3.0         4
21688  Afghanistan  1990       0.0         4

In [27]:
# "зафиксировать" датафрейм data с этой сортировкой
data = data.sort_values(by=['country', 'year', 'quantity'], ascending=[True, True, False])
data.head()

            country  year   quantity  category
835137  Afghanistan  1990  3902100.0        42
492297  Afghanistan  1990   512000.0        31
491412  Afghanistan  1990   400000.0        31
492006  Afghanistan  1990   112000.0        31
491548  Afghanistan  1990    66000.0        31

In [28]:
# ПАРАМЕТР INPLACE
data.sort_values(by=['country', 'year', 'quantity'], ascending=[True, True, False], inplace=True)
data.head()

            country  year   quantity  category
835137  Afghanistan  1990  3902100.0        42
492297  Afghanistan  1990   512000.0        31
491412  Afghanistan  1990   400000.0        31
492006  Afghanistan  1990   112000.0        31
491548  Afghanistan  1990    66000.0        31

In [29]:
data1.head()

     Year  Month    ID Product  Amount   Price    Total    Cost
0  2012.0    1.0  t001      A1     7.0  2904.0  20328.0  1200.0
1  2012.0    1.0  t002      A2     2.0  1896.0   3792.0  1100.0
2  2012.0    2.0  t003      A1     5.0  2904.0  14520.0  1200.0
3  2012.0    2.0  t004      A4     1.0  8618.0   8618.0  4200.0
4  2012.0    2.0  t005      A5     3.0  5175.0  15525.0   500.0

In [58]:
data1.loc[data1['Product']=='_8'].sort_values(by='Cost').head()

      Year  Month    ID Product  Amount   Price    Total   Cost
22  2012.0    6.0  t023      _8    10.0  3760.0  37600.0  200.0
37  2012.0    9.0  t038      _8     1.0  3760.0   3760.0  700.0
26  2012.0    6.0  t027      _8     3.0  3760.0  11280.0  800.0
41  2012.0   10.0  t042      _8     3.0  3760.0  11280.0  800.0
58  2012.0   12.0  t059      _8     3.0  3760.0  11280.0  800.0

In [96]:
data1[data1['Product'] == '_8'].sort_values(by='Cost').reset_index().loc[0]['ID']

't023'

# ПОСТАНОВКА ЗАДАЧИ
Вам необходимо посчитать заданную метрику по данным файла power.csv: каково суммарное потребление стран Прибалтики категорий 4, 12 и 21 за период с 2005 по 2010 года? Не учитывайте в расчетах отрицательные значения quantity.

Итого по шагам:

1. Выясните как называются в датасете Латвия, Литва и Эстония (берем только эти страны). Отфильтруйте датасет по этим странам.

2. Оставьте в датафрейме только те строки, год которых приходится на период с 2005 по 2010 включительно.

3. Удалите строки со значением столбца quantity < 0.

4. Оставьте в датафрейме только строки со значением столбца category, равным 4, 12 или 21. Проще всего использовать метод isin.

5. Посчитайте сумму столбца quantity.

In [99]:
data = pd.read_csv('power.csv')
data.head()

   country  year  quantity  category
0  Austria  1996       5.0         1
1  Austria  1995      17.0         1
2  Belgium  2014       0.0         1
3  Belgium  2013       0.0         1
4  Belgium  2012      35.0         1

In [79]:
data.shape

(1189482, 4)

In [100]:
data[ data['country'].str.contains('ston', case=False) ]['country'].unique()

array(['Estonia'], dtype=object)

In [101]:
data = data.loc[data['quantity'] > 0]
data.head()

   country  year  quantity  category
0  Austria  1996       5.0         1
1  Austria  1995      17.0         1
4  Belgium  2012      35.0         1
5  Belgium  2011      25.0         1
6  Belgium  2010      22.0         1

In [81]:
data.shape

(1115866, 4)

In [102]:
data = data.loc[((data['category'] == 4)  | (data['category'] == 12)  | (data['category'] == 21) )]
data.head()

        country  year  quantity  category
9834  Swaziland  2014      0.15         4
9835  Swaziland  2013      0.15         4
9836  Swaziland  2012      0.15         4
9837  Swaziland  2011      0.15         4
9838  Swaziland  2010      0.18         4

In [83]:
data.shape

(83053, 4)

In [103]:
data = data[ ((data['country']=='Lithuania') | (data['country']=='Latvia') | (data['country'] == 'Estonia')) & 
     ((filtered_countries['year'] >= 2005) &  (filtered_countries['year'] <= 2010))]
data.head()

C:\Users\shchepkina-ev\AppData\Local\Continuum\anaconda3\lib\site-packages\ipykernel_launcher.py:2: UserWarning: Boolean Series key will be reindexed to match DataFrame index.

         country  year  quantity  category
10617    Estonia  2008       1.0         4
10620    Estonia  2005       1.0         4
11156  Lithuania  2008       1.0         4
11158  Lithuania  2006       1.0         4
11159  Lithuania  2005       1.0         4

In [104]:
data[ ((data['country']=='Latvia') | (data['country']=='Lithuania')  | (data['country']=='Estonia')) & 
     ((data['year']>2005) & (data['year'] <2010))]['year'].value_counts()

2008    72
2007    58
2009    54
2006    54
Name: year, dtype: int64

In [93]:
data.shape

(238, 4)

In [105]:
data['quantity'].sum()

240580.0

# Выполненное Домашнее задание с сайта курсов

In [97]:
# посчитать заданную метрику по данным файла power.csv: каково суммарное
# потребление стран Прибалтики  категорий 4, 12 и 21 за период с 2005 по 2010 года
data = pd.read_csv('power.csv')
# Выясним, как в датафрейме называются Литва, Латвия и Эстония
countries = [ x for x in data['country'].unique() if 'Lit' in x or 'Lat' in x or 'Est' in x]
countries

['Lithuania', 'Latvia', 'Estonia']

In [98]:
# Оставляем только те строки датафрейма, которые содержат 'Lithuania', 'Latvia', 'Estonia'
filtered_countries = data[ (data['country']=='Lithuania') | (data['country']=='Latvia')
                         | (data['country'] == 'Estonia')]

# Оставьте в датафрейме только те строки, 
# год которых приходится на период с 2005 по 2010 включительно
filtered_countries = filtered_countries[(filtered_countries['year'] >= 2005) & 
                                        (filtered_countries['year'] <= 2010)]
# Удалим строки со значением столбца quantity < 0
filtered_countries = filtered_countries[filtered_countries['quantity'] >= 0]

# Оставим в датафрейме только строки со значением столбца category, равным 4, 12 или 21. 
filtered_countries = filtered_countries[(filtered_countries['category'] == 4) |
                                        (filtered_countries['category'] == 12) |
                                        (filtered_countries['category'] == 21)]

# Посчитаум сумму столбца quantity.
filtered_countries['quantity'].sum()

240580.0